Revit 2024 API
StructuralFramingUtils.SetEndReference Method
 Sets the end reference of a framing element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static void SetEndReference(
	FamilyInstance familyInstance,
	int end,
	Reference pick
)
Visual Basic
Public Shared Sub SetEndReference ( _
	familyInstance As FamilyInstance, _
	end As Integer, _
	pick As Reference _
)
Visual C++
public:
static void SetEndReference(
	FamilyInstance^ familyInstance,
	int end,
	Reference^ pick
)
Parameters
familyInstance
Type: Autodesk.Revit.DB.FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end
Type: System.Int32
 The index of the end (0 for the start, 1 for the end).
pick
Type: Autodesk.Revit.DB.Reference
 The reference to set to the given end.
Remarks
 The setback value will be changed as a result of the removal.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  end must be 0 or 1.
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set. -or- The input pick cannot be set as the end reference for the given end of the structural framing element.
See Also
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace